<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses io.github.hjuutilainen.download.TeamViewer recipe to download latest TeamViewer Then, uploads to the Jamf Pro Server.</string>
	<key>Identifier</key>
	<string>com.justinrummel.jss.TeamViewer</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Web Browsers and Internet Utilities</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>TeamViewer</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Establish incoming and outgoing remote desktop and computer-to-computer connections for real-time support or access to files, networks and programs. Collaborate online, participate in meetings, chat with other people or groups, and make video calls in one click. After downloading and installing this software, you'll have your first session up and running within seconds.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>TeamViewer.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.5</string>
	<key>ParentRecipe</key>
	<string>com.justinrummel.pkg.TeamViewer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>scripts</key>
				<array>
					<dict>
						<key>name</key>
						<string>%NAME%-preinstall.sh</string>
						<key>template_path</key>
						<string>%NAME%-preinstall-ScriptTemplate.xml</string>
					</dict>
				</array>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
