<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
    <string>Downloads the latest automated development build of Wireshark and creates a pkg. (For stable versions of Wireshark, see the Wireshark recipes in homebysix-recipes.)</string>
	<key>Identifier</key>
	<string>com.justinrummel.pkg.WiresharkDev</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Wireshark</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.justinrummel.download.WiresharkDev</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
	</array>
</dict>
</plist>
