<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent pkg recipe to downloads latest version of WiresharkDev and import it into the JSS.</string>
	<key>Identifier</key>
	<string>com.justinrummel.jss.WiresharkDev</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>%NAME%</string>
		<key>SMART_GROUP</key>
		<string>LessThanMostRecent_%NAME%</string>
		<key>SELFSERVE_POLICY</key>
		<string>SelfServeLatest_%NAME%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.justinrummel.pkg.WiresharkDev</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%version%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>smart_group</key>
				<string>%SMART_GROUP%</string>
				<key>selfserve_policy</key>
				<string>%SELFSERVE_POLICY%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
