<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>the Development release of Wireshark.</string>
    <key>Identifier</key>
    <string>com.justinrummel.download.WiresharkDev</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wireshark</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wireshark.org/download.html</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Safari 8.0.2</string>
                </dict>
                <key>re_pattern</key>
                <string>((Wireshark )(2)\.(\d{1,2})\.(\d{1,2})(|rc\d{1,2})( Intel 64.dmg))</string>
                <key>re_flags</key>
                <array>
                    <string>MULTILINE</string>
                    <string>DOTALL</string>
                </array>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://1.na.dl.wireshark.org/osx/%match%</string>
                <key>filename</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>