<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest automated development build of Wireshark. (For stable versions of Wireshark, see the Wireshark recipes in homebysix-recipes.)
    
Valid values for ARCH include:
- "Intel" (default, Intel)
- "Arm" (Apple Silicon)
</string>
    <key>Identifier</key>
    <string>com.justinrummel.download.WiresharkDev</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wireshark</string>
        <key>ARCH</key>
        <string>Intel</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wireshark.org/download/automated/osx/?C=M;O=D</string>
                <key>re_pattern</key>
                <string>href="(Wireshark%20[\d\.]+rc[0-9a-z\-]+%20%ARCH%%2064\.dmg)"</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wireshark.org/download/automated/osx/%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Wireshark.app</string>
                <key>requirement</key>
                <string>identifier "org.wireshark.Wireshark" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7Z6EMTD2C6"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
